Revit 2027 API
ConduitSizeSettings.GetConduitSizeSettings Method
 Gets the conduit size settings of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ConduitSizeSettings GetConduitSizeSettings(
	Document aDoc
)
Public Shared Function GetConduitSizeSettings (
	aDoc As Document
) As ConduitSizeSettings
public:
static ConduitSizeSettings^ GetConduitSizeSettings(
	Document^ aDoc
)
static member GetConduitSizeSettings :
        aDoc : Document -> ConduitSizeSettings
Parameters
aDoc Document
 The document.
Return Value
ConduitSizeSettings
 The conduit size settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace